//***************************************************************
//*  程 序 名：7_10.cpp                                         *
//*  主要功能：                                                 *
//*     使用寄存器变量计算1+2+3+……+n的值                      *
//***************************************************************
#include <iostream>                         // 包含输入输出接口文件
using namespace std;                        // 引用标准命名空间
long sum(int n)                             // 求1到n的自然数之和
{
    register int i = 0;                    // 定义寄存器变量
	long  s = 0;
    for(i = 1; i <= n; i++)
    {
        s = s + i;
    }
    return s;                               // 将程序的执行流程和累加和带回到主调函数
}
int main()
{
    int n = 0;
    cout << "n=";
    cin >> n;
    cout << "1到" << n <<"的自然数之和为：" << sum(n) << endl;
    return 0;
}
