//***************************************************************
//*  程 序 名：7_6.cpp                                          *
//*  主要功能：                                                 *
//*     测试外部变量的作用域延伸                                *
//***************************************************************
#include <iostream>                         // 包含输入输出接口文件
using namespace std;                        // 引用标准命名空间
int var1 = 200;                             // var1为所有函数之前定义的外部变量
void varScope()                             // 测试变量作用域的函数
{  
    extern float var2;                      // 将外部变量var2作用域向上扩展到本函数
    cout << "var2=" << var2 << endl;
    return;                                 // 将程序的执行流程带回到主调函数
}
float var2 = 100;                           // var2为在程序中间定义的外部变量
int main()
{  
    varScope();
    cout << "var1=" << var1 << endl;
    return 0;
}
