//***************************************************************
//*  程 序 名：7_8.cpp                                          *
//*  主要功能：                                                 *
//*     演示全局变量、自动变量和静态局部变量的使用              *
//***************************************************************
#include <iostream>                         // 包含输入输出接口文件
using namespace std;                        // 引用标准命名空间
int c = 0;                                  // 定义全局变量并初始化
void test();                                // 函数声明
int main()
{
    int a = 1, b = 2;                       // 定义内部变量
    c = 3;                                  // 主函数中改变全局变量c的值
    cout << " ---------------test()------------" << endl;
    cout << "\n静态局部变量  自动变量  全局变量" << endl;
    for(int i = 1; i <= 3; i++)
    {
        test();                             // 调用test()函数
    }
    cout << "\n -----------main()-------------" << endl;
    cout << "\n局部变量\t全局变量" << endl;
    cout << "a=" << a << ", b=" << b << "\t c= " << c << endl;
    return 0;
}
void test()                                 // 函数头
{                                           // 函数定义开始
    static int a = 0;                       // 定义静态局部变量
    auto int b = 0;                         // 定义自动变量
    a++;
    b++;
    c++;                                    // test函数中改变全局变量c的值
    cout << "  a= " << a << "\t\tb= " << b << "\t c= " << c << endl;
    return;                                 // 将程序的执行流程带回到主调函数
}                                           // 函数定义结束
