//***************************************************************
//*  程 序 名：4_10.cpp                                         *
//*  主要功能：                                                 *
//*     计算冰山的体积                                          *
//***************************************************************

#include <iostream>                 // 包含输入输出接口文件
using namespace std;                // 引用标准命名空间 

int main()                          // 主函数
{
    const int m = 5;                // 总行数
    const int n = 7;                // 总列数
    int ice[m][n] = {
        {0, 1, 1, 2, 1, 2, 1},
        {1, 4, 2, 1, 4, 3, 1},
        {2, 5, 3, 5, 2, 2, 3},
        {2, 3, 4, 1, 2, 1, 0},
        {1, 0, 3, 0, 1, 0, 0}
    };
    int i = 0, j = 0;               // 表示行号、列号的循环变量
    int totalHeight = 0;            // 存储高度的累加和

    for(i = 0; i < m; i++)
    {                               // 循环处理每一行
        for(j = 0; j < n; j++)
        {                           // 循环累加每一列的高度
            totalHeight = totalHeight + ice[i][j];
        }
    }

    cout<<"冰山的体积为："<<totalHeight*100<<"立方米"<<endl;
    return 0;
}
