//***************************************************************
//*  程 序 名：4_13.cpp                                         *
//*  主要功能：                                                 *
//*     灯的明灭                                                *
//***************************************************************

#include <iostream>                 // 包含输入输出接口文件
using namespace std;                // 引用标准命名空间 

int main()                          // 主函数
{
    const int MaxN = 10000;         // 定义灯数的最大值
    int lamp[MaxN+1] = {0};         // 存储灯的状态的数组，值为1表示灯亮，0表示灯灭
    int n = 0;                      // 灯数
    int i = 0, j = 0;               // 循环变量

    cout<<"请输入灯的数量：";
    cin>>n;

    for(i = 1; i <= n; i++)         // 依次处理每个人的操作
    {                       
        for(j = i; j <= n; j = j + i)
        {                           // 依次处理第i个人需处理的灯 
            lamp[j] = !lamp[j];     // 将第j号灯的状态作相反处理
        }
    }

    cout<<"还亮着的灯："<<endl;
    i = 0;                          // 亮着的灯的数量
    for(j = 1; j <= n; j++)
    {
        if(lamp[j])                 // 如果第j号灯是亮着的
        {
            cout<<j<<"\t";          // 输出灯号
            i++;                    // 亮着的灯数增1
            if(i % 5 == 0)          // 输出格式控制，每输出5个灯号后换行
            {
                cout<<endl;
            }
        }
    }

    return 0;
}
