//***************************************************************
//*  程 序 名：4_4a.cpp                                         *
//*  主要功能：                                                 * 
//*     冒泡排序法排序                                          *
//*     从前往后比较，逆序交换                                  *
//***************************************************************

#include <iostream>                 // 包含输入输出接口文件
using namespace std;                // 引用标准命名空间 
int main()                          // 主函数
{
    const int n = 6;                // 使用常1变量定义学生人数
    int score[n + 1] = {0, 92, 88, 74, 93, 85, 79};                   
                                    // 待排序成绩数组，有n+1个整型元素，其中下标0处未存放学生成绩
    int i = 0;                      // 排序趟数
    int j = 0;                      // 待比较元素的下标
    
    for(i = 1; i < n; i++)
    {
        for(j = 1; j <= n - i; j++)
        {
            if(score[j] > score[j + 1])     // 相邻元素逆序
            {
                score[0] = score[j];        // 以score[0]为临时变量，交换score[j]和score[j+1]
                score[j] = score[j + 1];
                score[j + 1] = score[0];
            }
        }
    }

    for(j = 1; j <= n; j++)
    {
        cout<<"score["<<j<<"]="<<score[j]<<endl;
    }
    return 0;
}
