//***************************************************************
//*  程 序 名：2_10.cpp                                         *
//*  主要功能：                                                 *
//*     字符串输出示例                                          *
//***************************************************************
#include <iostream>                         // 包含输入输出接口文件
using namespace std;                        // 引用标准命名空间 
int main()                                  // 定义主函数
{                                           // 主函数开始
    printf("%s\n", "studentID");
    printf("%10s\n", "studentID");
    printf("%10.3s\n", "studentID");
    return 0;                               // 函数返回值为0
}                                           // 主函数结束
