//***************************************************************
//*  程 序 名：3_3.cpp                                          *
//*  主要功能：                                                 * 
//*     根据用户输入的编号，输出需要调用的操作模块名称          *
//***************************************************************
#include <iostream>                         // 包含输入输出接口文件
using namespace std;                        // 引用标准命名空间 
int main()                                  // 定义主函数
{                                           // 显示主菜单
    cout<<"\n\n\n\n\n";
    cout<<"\t\t|-------------------学生选课系统--------------|\n";
    cout<<"\t\t|\t 0. 退出                              |\n";
    cout<<"\t\t|\t 1. 学生信息管理                      |\n";
    cout<<"\t\t|\t 2. 教师信息管理                      |\n";
    cout<<"\t\t|\t 3. 课程信息管理                      |\n";
    cout<<"\t\t|\t 4. 学生选课管理                      |\n";
    cout<<"\t\t|\t 5. 学生成绩管理                      |\n";
    cout<<"\t\t|\t 6. 信息统计模块                      |\n";
    cout<<"\t\t|\t 7. 信息显示模块                      |\n";
    cout<<"\t\t|---------------------------------------------|\n\n";
    cout<<"\t\t\t请输入模块编号(0-7):";
    int choice;								
    cin >> choice;                          // 由键盘输入编号
    switch(choice)                          // 根据输入，调用相应的操作模块
    {
        case 0: cout<<"退出\n"; break;
        case 2: cout<<"学生信息管理\n"; break;
        case 2: cout<<"教师信息管理\n"; break;
        case 3: cout<<"课程信息管理\n"; break;
        case 4: cout<<"学生选课管理\n"; break;
        case 5: cout<<"学生成绩管理\n"; break;
        case 6: cout<<"信息统计模块\n"; break;
        case 7: cout<<"信息显示模块\n"; break;
    }
    return 0;                               // 函数返回值为0
}                                           // 主函数结束
