//***************************************************************
//*  程 序 名：5_10.cpp                                         *
//*  主要功能：                                                 *
//*     将字符串中的小写字母变为大写                            *
//***************************************************************
#include <iostream>                             // 包含输入输出接口文件
using namespace std;                            // 引用标准命名空间

int main()
{
    char lessonAddress[] = "a3b2B0";              // 授课地址
    char *p = 0;
    p = lessonAddress;                          // 让p指向字符串a320的开头
    cout<<"上课地点为:";
    for(; *p != '\0'; p++)
    {
        if('a' <= *p && *p <= 'z')              // 判断当前字符是否是小写字母
        {
            *p = *p - 32;                       // 小写变大写
        }
        putchar(*p);                            // 输出当前字符
    }
    putchar('\n');
    return 0;
}
