//***************************************************************
//*  程 序 名：5_11.cpp                                         *
//*  主要功能：                                                 *
//*     测试存放字符串常量的只读内存                            *
//***************************************************************
#include <iostream>                         // 包含输入输出接口文件
using namespace std;                        // 引用标准命名空间

int main()
{
    char *p = "a320";                       // 让p指向字符串a320的开头
    for(; *p != '\0'; p++)
    {
        if('a' <= *p && *p <= 'z')          // 判断当前字符是否是小写字母
        {
           *p=*p - 32;               // 输出大写字母
        }
        
            putchar(*p);                    // 原样输出字符
        
    }
    putchar('\n');
    return 0;
}
