//***************************************************************
//*  程 序 名：5_12.cpp                                         *
//*  主要功能：                                                 *
//*     测试指针数组元素的本质及使用                            *
//***************************************************************
#include <iostream>                         // 包含输入输出接口文件
using namespace std;                        // 引用标准命名空间
int main()
{
    char str1[ ] = "China";
    char str2[ ] = "America";
    char str3[ ] = "German";
    char *pStr[3] = {str1, str2, str3};     // 定义指针数组p并初始化指向前三个字符串
    int i = 0;                              //循环变量
    cout << "\n指针数组的元素在内存中也是连续存放的！";
    cout << "\n=============================================================";
    for (i=0; i < 3; i++) 
    {
        cout << "\n元素pStr[" << i << "]:\t存放的首地址\t" << &pStr[i];	
    }
    cout << "\n\n指针数组的每个元素也是指针！";
    cout << "\n=============================================================";
    for (i=0; i < 3; i++) 
    {
        cout << "\n元素pStr[" << i << "]指向字符串：" << pStr[i]  ; 
    }
    cout << "\n\n通过指针数组的每个元素可以访问其指向的字符串和其中的各个字符！";
    cout << "\n=============================================================";
    for (i=0; i < 3; i++) 
    {
        cout << "\n元素pStr[" << i << "]指向的字符串" << pStr[i] 
             << " 的第3个字符是：" << *(pStr[i]+2); 		
    }
    cout << endl;
    return 0;
}
