//***************************************************************
//*  程 序 名：5_13.cpp                                         *
//*  主要功能：                                                 *
//*     测试双重指针的使用                                      *
//***************************************************************
#include <iostream>                         // 包含输入输出接口文件
using namespace std;                        // 引用标准命名空间

int main()
{
    char name[3][20] = {"China", "America", "German"};//二维数组存放多个字符串
    int i = 0;                              // 第一维下标变量, 代表二维数组的行
    cout << "\n通过双重指针访问字符串";
    cout << "\n=============================================================";
    for (i = 0; i < 3; i++) 
    {
        cout << "\n第" << i+1 << "个字符串的首地址：" << name + i ; 
        cout << "。\t指向的字符串是：" << name[i]  <<endl;
    }
    cout << "\n\n通过双重指针访问字符串中的各个字符！";
    cout << "\n=============================================================";
    for (i = 0; i < 3; i++) 
    {
        cout << "\n元素 name[" << i << "] 指向字符串：" << *(name+i);
        cout << " 其中的第3个字符是：" << *(*(name+i) +2) << endl;
    }
    cout << endl;
    return 0;
}
