//***************************************************************
//*  程 序 名：5_9.cpp                                          *
//*  主要功能：                                                 *
//*     将数字字符串转为整数                                    *
//***************************************************************
#include <iostream>                             // 宏包含预编译命令
using namespace std;                            // 引用标准命名空间

int main()
{
    char stuNo[20] = "";                        // 定义字符数组用来存放学号
    int i = 0 ;                                 // 数组下标变量
    int number = 0;                             // 存放转换后得到的整数
    cout << "请输入学生的学号:";
    cin >> stuNo;	                            // 从键盘输入整型字符串到字符数组中
    while(stuNo[i] != '\0' && stuNo[i] >= '0' && stuNo[i] <= '9')
    {		
        number = 10 * number + (stuNo[i] - '0');// 数字字符转为整数
        i++;		
    }
    cout << "转换出的整数为：" << number <<endl;
    return 0;
}
