//***************************************************************
//*  程 序 名：1_1.cpp                                          *
//*  主要功能：                                                 * 
//*     显示字符串“我叫王小二，我是一个学生”                  *
//***************************************************************
#include <iostream>                         // 包含输入输出接口文件
using namespace std;                        // 引用标准命名空间 
int main()                                  // 定义主函数
{                                           // 主函数开始
	cout<<"我叫王小二，我是一个学生"<<endl; // 显示字符串
    return 0;                               // 函数返回值为0
}                                           // 主函数结束
