//***************************************************************
//*  程 序 名：1_3.cpp                                          *
//*  主要功能：                                                 * 
//*     显示主菜单，并获取用户输入的模块编号                    *
//***************************************************************
#include <iostream>                         // 包含输入输出接口文件
using namespace std;                        // 引用标准命名空间 
void mainMenu();                            // 申明主菜单函数
int main()                                  // 定义主函数
{                                           // 主函数开始
    char choice = '0';                      // 用户选择的模块编号，默认为0
    mainMenu();                             // 调用主菜单函数
    cin>>choice;                            // 获取用户输入的模块编号
    cout<<"你输入的模块号："<<choice<<endl; // 输出模块编号
    return 0;                               // 函数返回值为0
}                                           // 主函数结束

void mainMenu()			                    // 主菜单函数
{
    system("cls");
    cout<<"\n\n\n\n\n";
    cout<<"\t\t|---------------学生选课系统(学生版)------------|\n";
    cout<<"\t\t|\t 0. 退出                                |\n";
    cout<<"\t\t|\t 1. 学生信息管理                        |\n";
    cout<<"\t\t|\t 2. 教师信息管理                        |\n";
    cout<<"\t\t|\t 3. 课程信息管理                        |\n";
    cout<<"\t\t|\t 4. 学生选课管理                        |\n";
    cout<<"\t\t|\t 5. 学生成绩管理                        |\n";
    cout<<"\t\t|\t 6. 信息统计模块                        |\n";
    cout<<"\t\t|\t 7. 信息显示模块                        |\n";
    cout<<"\t\t|-----------------------------------------------|\n\n";
    cout<<"\t\t\t请输入模块编号(0-7):";
}
