//***************************************************************
//*  程 序 名：9_8.cpp                                          *
//*  主要功能：                                                 * 
//*     复数的表示和输出                                        *
//***************************************************************
#include  <iostream> 
using namespace std;
typedef struct
{
    int real;                               // 存储复数的实部
    int img;                                // 存储复数的虚部
}plural;                                    // 定义复数类型plural

int main()
{
    plural p[3] = {{1, 2}, {3, 4}, {5, 6}}; // 定义复数数组并初始化
    int i;                                  // 用于存储数组下标
    for(i = 0;i < 3;i++)                    // 依次输出每个复数
    {
        cout<<"第"<<(i+1)<<"个复数为："<< p[i].real<<"+"<< p[i].img<<"i"<<endl;
    }
    return 0;
}
