//********************************************************* 
//*程序名：实训2_3 										  *
//*主要功能： 											  *
//*		输入给定高长的长方体的长和宽，计算其体积     	  *
//*********************************************************
#include <iostream>	//包含输入输出接口文件
#include <math.h>	//包含数学运算接口文件 
using namespace std; //引用标准命名空间 
int main()			//定义主函数 
{					//主函数开始 
	double a=0.0, b=0.0;
	double h=5.0, V=0.0;
	cout<<"长方体的高为："<< h<<"\n"; 
	cout<<"请输入长方体的长和宽(如：a b)：";
	cin>>a>>b;
	V = a*b*h;
	cout<<"长方体的体积："<<V <<endl;
	return 0;
 } 
