//********************************************
//*程序名：实训2_1.cp                        *
//*主要功能：
//*		显示主菜单，并获取用户输入的模块编号 *
//********************************************
#include <iostream>		//包含输入输出接口文件 
using namespace std;	//引用标准命名空间 
int main()				//定义主函数 
{						//主函数开始 
	system("cls");
    cout<<"\n\n\n\n\n";
   cout<<"\t\t|--------学生选课系统（学生版）--------|\n";
	cout<<"\t\t|\t 0. 返回                       |\n";
	cout<<"\t\t|\t 1. 学生信息管理               |\n";
	cout<<"\t\t|\t 2. 教师信息                   |\n";
	cout<<"\t\t|\t 3. 课程信息管理               |\n";
	cout<<"\t\t|\t 4. 学生选课信息               |\n";
	cout<<"\t\t|\t 5. 学生成绩管理               |\n";
	cout<<"\t\t|\t 6. 信息统计模                 |\n";
	cout<<"\t\t|--------------------------------------|\n\n";
	cout<<"\t\t\t请输入模块号（0-6）：";
    	return 0;
}

